***** tracing - vanilla PD

#+begin_src bash
PD=~/src/perfect-dark pd-addr 0x80070750
#+end_src

#+RESULTS:
| address |           0x80070750 |
| symbol  | g_PlayersWithControl |


#+begin_src c :noeval
// data.h
/**:266**/ extern bool g_PlayersWithControl[];
#+end_src


***** tracing - vanilla PD
#+begin_src bash
PD=~/src/perfect-dark pd-addr 0x8009A26C
#+end_src

#+RESULTS:
| address | 0x8009a26c |        |       |
| symbol  |     g_Vars | offset | 0x2ac |

#+begin_src c :noeval
struct g_vars {
    //...
    /*0002ac*/ s32 tickmode;
    //...
}
#+end_src



***** tracing - vanilla PD

#+begin_src bash
ADDRESS=0x800624C4
export PD=~/src/perfect-dark
pd-addr $ADDRESS
#+end_src

#+RESULTS:
| address |   0x800624c4 |
| symbol  | g_TitleTimer |



#+RESULTS:
| address |   0x800624c4 |
| symbol  | g_TitleTimer |


***** tracing - vanilla PD

#+begin_src bash
PD=~/src/perfect-dark pd-addr 0x800624E4
#+end_src

#+RESULTS:
| address |       0x800624e4 |
| symbol  | g_TitleNextStage |

#+begin_src c :noeval
//data.h
    extern s32 g_TitleNextStage;
#+end_src


***** tracing - vanilla PD
#+begin_src bash
ADDRESS=0x8006FF1C
export PD=~/src/perfect-dark
pd-addr $ADDRESS
#+end_src

#+RESULTS:
| address | 0x8006ff1c |        |     |
| symbol  |  g_Weapons | offset | 0x4 |

***** tracing - vanilla PD

#+begin_src bash
PD=~/src/perfect-dark pd-addr 0x800ACBA6
#+end_src

#+RESULTS:
| address | 0x800acba6 |        |      |
| symbol  |  g_MpSetup | offset | 0x1e |



#+RESULTS:
| address | 0x800acba6 |        |      |
| symbol  |  g_MpSetup | offset | 0x1e |


***** tracing - vanilla PD

#+begin_src bash
PD=~/src/perfect-dark pd-addr 0x803CD680
#+end_src

#+RESULTS:
| address | 0x803cd680 |        |          |
| symbol  |   g_HtData | offset | 0x3204d0 |

***** tracing - vanilla PD

#+begin_src bash
PD=~/src/perfect-dark pd-addr 0x802EAA5C
#+end_src

#+RESULTS:
| address | 0x802eaa5c |        |          |
| symbol  |   g_HtData | offset | 0x23d8ac |


***** tracing - vanilla PD

#+begin_src bash
PD=~/src/perfect-dark pd-addr 0x803C79F0
#+end_src

#+RESULTS:
| address | 0x803c79f0 |        |          |
| symbol  |   g_HtData | offset | 0x31a840 |

***** tracing - vanilla PD

#+begin_src bash
ADDRESS=0x802EACFC
export PD=~/src/perfect-dark
pd-addr $ADDRESS
#+end_src

#+RESULTS:
| address | 0x802eacfc |        |          |
| symbol  |   g_HtData | offset | 0x23db4c |

***** tracing - vanilla PD

#+begin_src bash
ADDRESS=0x802DA8F8
export PD=~/src/perfect-dark
pd-addr $ADDRESS
#+end_src

#+RESULTS:
| address | 0x802da8f8 |        |          |
| symbol  |   g_HtData | offset | 0x22d748 |



***** tracing - vanilla PD

#+begin_src bash
ADDRESS=0x802DA924
export PD=~/src/perfect-dark
pd-addr $ADDRESS
#+end_src

#+RESULTS:
| address | 0x802da924 |        |          |
| symbol  |   g_HtData | offset | 0x22d774 |



#+RESULTS:
| address | 0x802da924 |        |          |
| symbol  |   g_HtData | offset | 0x22d774 |

***** tracing - vanilla PD

#+begin_src bash
ADDRESS=0x80372728
export PD=~/src/perfect-dark
pd-addr $ADDRESS
#+end_src

#+RESULTS:
| address | 0x80372728 |        |          |
| symbol  |   g_HtData | offset | 0x2c5578 |


***** tracing - vanilla PD

#+begin_src bash
ADDRESS=0x803727A0
export PD=~/src/perfect-dark
pd-addr $ADDRESS
#+end_src

#+RESULTS:
| address | 0x803727a0 |        |          |
| symbol  |   g_HtData | offset | 0x2c55f0 |

***** tracing - vanilla PD
#+begin_src bash
ADDRESS=0x803CAE78
export PD=~/src/perfect-dark
pd-addr $ADDRESS
#+end_src

#+RESULTS:
| address | 0x803cae78 |        |          |
| symbol  |   g_HtData | offset | 0x31dcc8 |

***** tracing - vanilla PD
#+begin_src bash
ADDRESS=0x802EA2BC
export PD=~/src/perfect-dark
pd-addr $ADDRESS
#+end_src

#+RESULTS:
| address | 0x802ea2bc |        |          |
| symbol  |   g_HtData | offset | 0x23d10c |

***** tracing - vanilla PD
#+begin_src bash
ADDRESS=0x803D2CDC
export PD=~/src/perfect-dark
pd-addr $ADDRESS
#+end_src

#+RESULTS:
| address | 0x803d2cdc |        |          |
| symbol  |   g_HtData | offset | 0x325b2c |

***** tracing - vanilla PD
#+begin_src bash
ADDRESS=0x802DB68C
export PD=~/src/perfect-dark
pd-addr $ADDRESS
#+end_src

#+RESULTS:
| address | 0x802db68c |        |          |
| symbol  |   g_HtData | offset | 0x22e4dc |
***** tracing - vanilla PD
#+begin_src bash
ADDRESS=0x80322D9C
export PD=~/src/perfect-dark
pd-addr $ADDRESS
#+end_src

#+RESULTS:
| address | 0x80322d9c |        |          |
| symbol  |   g_HtData | offset | 0x275bec |
***** tracing - vanilla PD
#+begin_src bash
ADDRESS=0x802F13E8
export PD=~/src/perfect-dark
pd-addr $ADDRESS
#+end_src

#+RESULTS:
| address | 0x802f13e8 |        |          |
| symbol  |   g_HtData | offset | 0x244238 |
***** tracing - vanilla PD
#+begin_src bash
ADDRESS=0x802F143C
export PD=~/src/perfect-dark
pd-addr $ADDRESS
#+end_src

#+RESULTS:
| address | 0x802f143c |        |          |
| symbol  |   g_HtData | offset | 0x24428c |